app/views/sliders/_form.html.erb

SELECT `empresas`.* FROM `empresas`
---

        <%= f.select :id_empresa, options_for_select(Empresa.all.collect { |c| [c.nombre, c.id] }.insert(0, '')) %>