app/views/principal/index.html.erb

SELECT COUNT(*) FROM `promocions` WHERE `promocions`.`id_empresa` = 1
---

            <% if ( Promocion.where(:id_empresa => "#{empresa.id}").count ) > 0 %>

SELECT COUNT(*) FROM `cupons` WHERE `cupons`.`id_empresa` = 1
---

			<% if (Cupon.where(:id_empresa => "#{empresa.id}").count ) > 0 %>