app/views/promocions/_form.html.erb

SELECT `supercategoria`.* FROM `supercategoria`
---
        <% end %>
        <%= f.select :id_supercategoria, options_for_select(Supercategorium.all.collect { |c| [c.nombre, c.id] }.insert(0, '')), :required => "true" %>

SELECT `empresas`.* FROM `empresas`
---
                <br/>
                <%= f.select :id_empresa, options_for_select(Empresa.all.collect { |c| [c.nombre, c.id] }.insert(0, '')) %>