app/views/personas/index.html.erb

SELECT `personas`.* FROM `personas` WHERE `personas`.`id_usuario` = 4
---
          <% van=current_user.id %>
          <% @personas = Persona.find(:all, :conditions => {:id_usuario => " #{van}"}) %>