app/views/empresas/_form.html.erb

                <br/>
                <%= f.select :estado, options_for_select(Estado.all.collect { |c| [c.nombre, c.id] }.insert(0, ''), "1") %>
---
SELECT `estados`.* FROM `estados`


        <%= f.select :id_categoria, options_for_select(Categorium.all.collect { |c| [c.nombre, c.id] }.insert(0, ''), "#{@empresa.id_categoria}"), :required => "true", :name => "id_categoria" %>
---
SELECT `categoria`.* FROM `categoria`


        <%= f.select :id_departamento, options_for_select(Departamento.all.collect { |c| [c.nombre, c.id] }.insert(0, ''), "#{@empresa.id_departamento}"), :required => "true" %>
---
SELECT `departamentos`.* FROM `departamentos`

        <% end %>
        <%= f.select :id_ciudad, options_for_select(Ciudad.all.collect { |c| [c.nombre, c.id] }.insert(0, ''), "#{@empresa.id_ciudad}"), :required => "true" %>
---
SELECT `ciudads`.* FROM `ciudads`

        <% $emailuser %>
        <% @users = User.find(:all, :conditions => {:email => "#{$emailuser}"}) %>
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'empresa1@empresa1.com'