app/views/empresas/buscar.html.erb

SELECT COUNT(*) FROM `cupons` WHERE `cupons`.`id_empresa` = 1
SELECT COUNT(*) FROM `promocions` WHERE `promocions`.`id_empresa` = 1
---
<% @empresas.each do |empresa| %>
    <% if ((Promocion.where(:id_empresa => "#{empresa.id}").count) + Cupon.where(:id_empresa => "#{empresa.id}").count) > 0 %>