app/views/empresas/buscapromo.html.erb

SELECT `empresas`.* FROM `empresas` WHERE `empresas`.`id` = 1
---
            <td>
              <% @hola = Empresa.find(:all, :conditions => {:id => "#{promo.id_empresa}"}) %>

SELECT `departamentos`.* FROM `departamentos` WHERE `departamentos`.`id` = 2
---
                      <br>
                      <% @departamentos = Departamento.find(:all, :conditions => {:id => " #{c.id_departamento}"}) %>