app/views/empresas/show.html.erb

    </tr>
    <% @categorias = Categorium.find(:all, :conditions => {:id => " #{@empresa.id_categoria}"}) %>
---
SELECT `categoria`.* FROM `categoria` WHERE `categoria`.`id` = 3

    </tr>
    <% @departamentos = Departamento.find(:all, :conditions => {:id => " #{@empresa.id_departamento}"}) %>
---
SELECT `departamentos`.* FROM `departamentos` WHERE `departamentos`.`id` = 2