app/controllers/empresas_controller.rb

  def index
    @empresas = Empresa.all
---
SELECT `empresas`.* FROM `empresas`

  def buscar
    if  params[:search].present?
      @empresas = Empresa.find(:all, :conditions => ["descripcion like ? ", "%"+params[:search]+"%"])
      if @empresas.count == 0
        respond_to do |format|
          format.html { redirect_to :controller => "empresas", :action => "buscar", notice: "No se han encontrado resultados.." }
          format.json { render json: @empresas }
        end
      end
    else
      @empresas = Empresa.all
---
SELECT `empresas`.* FROM `empresas` WHERE (descripcion like '%r%' )
SELECT `empresas`.* FROM `empresas`

  def buscapromo
    idempresa = params[:bp]
    @promocions = Promocion.find(:all, :conditions => {:id_empresa => " #{idempresa}"})
---
SELECT `empresas`.* FROM `empresas` WHERE `empresas`.`id` = 1
SELECT `promocions`.* FROM `promocions` WHERE `promocions`.`id_empresa` = 1

  def show
    @empresa = Empresa.find(params[:id])
---
SELECT `empresas`.* FROM `empresas` WHERE `empresas`.`id` = ? LIMIT 1  [["id", "1"]]

  def edit
    @empresa = Empresa.find(params[:id])
---
SELECT `empresas`.* FROM `empresas` WHERE `empresas`.`id` = ? LIMIT 1  [["id", "1"]]

  def create
    @empresa = Empresa.new(params[:empresa])

    respond_to do |format|
      if @empresa.save
---
INSERT INTO `empresas` (`created_at`, `descripcion`, `direccion`, `estado`, `horario`, `id_categoria`, `id_ciudad`, `id_departamento`, `id_usuario`, `imagen`, `nombre`, `pagina`, `telefono`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @empresa = Empresa.find(params[:id])

    respond_to do |format|
      if @empresa.update_attributes(params[:empresa])
---
SELECT `empresas`.* FROM `empresas` WHERE `empresas`.`id` = ? LIMIT 1  [["id", "1"]]
UPDATE `empresas` SET `estado` = 2, `updated_at` = '2013-03-19 23:42:20' WHERE `empresas`.`id` = 1

  def createempresa
    @user = User.new(params[:user])
    # email = params[ :email]
    # password=params[ :password]
    #  password_confirmation=params[ :password_confirmation]

    #  @user = User.new(:email=> "#{email}", :password_digest => "#{password}" )

    if @user.save
---
INSERT INTO `users` (`auth_token`, `created_at`, `email`, `password_digest`, `password_reset_sent_at`, `password_reset_token`, `tipo`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?, ?, ?)