app/controllers/password_resets_controller.rb

SELECT 1 FROM `users` WHERE (`users`.`email` = BINARY 'iverherlandth@gmail.com' AND `users`.`id` != 4) LIMIT 1
---
  def create
    user = User.find_by_email(params[:email])