app/controllers/principal_controller.rb

  def index
    #@empresas = Empresa.all
    @empresas = Empresa.where(:estado => "2")
---
SELECT `empresas`.* FROM `empresas` WHERE `empresas`.`estado` = 2