app/controllers/promocions_controller.rb

  def index
    @promocions = Promocion.all
---
SELECT `promocions`.* FROM `promocions`

  def show
    @promocion = Promocion.find(params[:id])
---
SELECT `promocions`.* FROM `promocions` WHERE `promocions`.`id` = ? LIMIT 1  [["id", "1"]]

  def create
    @promocion = Promocion.new(params[:promocion])

    respond_to do |format|
      if @promocion.save
---
INSERT INTO `promocions` (`created_at`, `descripcion`, `fechafin`, `fechaini`, `id_empresa`, `id_supercategoria`, `nombre`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?, ?, ?)