app/controllers/sliders_controller.rb

  def index
    @sliders = Slider.all
---
SELECT `sliders`.* FROM `sliders`

  def show
    @slider = Slider.find(params[:id])
---
SELECT `sliders`.* FROM `sliders` WHERE `sliders`.`id` = ? LIMIT 1  [["id", "1"]]

  def create
    @slider = Slider.new(params[:slider])

    respond_to do |format|
      if @slider.save
---
INSERT INTO `sliders` (`created_at`, `id_empresa`, `image`, `updated_at`) VALUES (?, ?, ?, ?)  [["created_at", Tue, 19 Mar 2013 23:44:14 UTC +00:00], ["id_empresa", 1], ["image", "67035_423970304363198_1967859683_n.jpg"], ["updated_at", Tue, 19 Mar 2013 23:44:14 UTC +00:00]]