app/views/application/_menu2.html.erb

<% @supercategoria = Supercategorium.all %>
<% @promocions = Promocion.all %>
<% @cupons = Cupon.all %>
---
SELECT `promocions`.* FROM `promocions`
SELECT `cupons`.* FROM `cupons`


  <% if   (Promocion.count + Cupon.count) > 0 %>
---
SELECT COUNT(*) FROM `cupons`
SELECT COUNT(*) FROM `promocions`

                <% if supercategoria.id_categoria == categorium.id %>
                    <% @contador1 = Promocion.where(:id_supercategoria => "#{supercategoria.id}").count %>
                    <% @contador2 = Cupon.where(:id_supercategoria => "#{supercategoria.id}").count %>
---
SELECT COUNT(*) FROM `promocions` WHERE `promocions`.`id_supercategoria` = 1
SELECT COUNT(*) FROM `cupons` WHERE `cupons`.`id_supercategoria` = 1